// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

// 5, 25  ->  да
// -4, 16  ->  да
// 25, 5  ->  да
// 8,9  ->  нет

// Console.Write("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// if(number1 == number2*number2 || number1 * number1 == number2)
// {
//     Console.Write("Да");
// }
// else
// {
//     Console.Write("Нет");
// }

// int number = Convert.ToDouble(Console.ReadLine());


// string username = Console.ReadLine();
// if(username == "Alexey")
// {
//     Console.Write("Ура, это же Alexey!");
// }
// else
// {
//     Console.Write("Привет, ");
//     Console.Write(username);
// }